app/Controllers/Home.php

    public function index(): string
    {
        // Créer une instance du modèle
        $messageModel = new \App\Models\messageModel();

        // Récupérer les données
        $data = $messageModel->findAll();
---
SELECT *
FROM `message`